<!DOCTYPE html><html lang="ru"><head><meta charset="utf-8"><meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1"><meta name="viewport" content="width=device-width"><meta name="author" content="Phil Rigovanov"><meta name="description" content="The personal blog of Phil Rigovanov mostly about religion"><meta name="keywords" content="Phil Rigovanov, blog"><link rel="alternate" type="application/rss+xml" title="RSS" href="/feed.xml"><title>Phil Rigovanov</title><!-- CSS--><link rel="stylesheet" href="/css/all.css"><link rel="stylesheet" href="http://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700|Abril+Fatface"><link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
<link rel="apple-touch-icon" href="/images/ico/apple-touch-icon-60x60.png" sizes="60x60">
<link rel="apple-touch-icon" href="/images/ico/apple-touch-icon-120x120.png" sizes="120x120">
<link rel="apple-touch-icon" href="/images/ico/apple-touch-icon-180x180.png" sizes="180x180">
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-26406005-6', 'auto');
  ga('send', 'pageview');

</script>
</head><body><div class="sidebar"><div class="container sidebar-sticky"><div class="sidebar-about"><h1><a href="http://phil.rigovanov.ru" target="_blank">Phil Rigovanov</a></h1><p class="lead">Personal blog</p></div><nav class="sidebar-nav"><a href="/" class="sidebar-nav-item active">Blog</a><a href="/about/" class="sidebar-nav-item">About</a><a href="/library/" class="sidebar-nav-item">Библиотека</a></nav><p>© 2017. All rights reserved.</p></div></div><div id="layout-main" class="content container"><div class="posts"><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/2019-new-year-resolutions/">Мои новогодние обещания</a></h2><small class="header-metadata"><time datetime="2019-01-01T00:00:00.000Z" class="timestamp">1 Jan 2019</time></small></header><section class="content-article">&#1071; &#1086;&#1073;&#1077;&#1097;&#1072;&#1102; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1041;&#1080;&#1073;&#1083;&#1080;&#1102; &#1079;&#1072; 2019 &#1075;&#1086;&#1076;, &#1095;&#1080;&#1090;&#1072;&#1103; &#1087;&#1086; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1075;&#1083;&#1072;&#1074;&#1099; &#1074; &#1076;&#1077;&#1085;&#1100;.&#10;&#1071; &#1086;&#1073;&#1077;&#1097;&#1072;&#1102; &#1087;&#1088;&#1086;&#1078;&#1080;&#1090;&#1100; 2019 &#1075;&#1086;&#1076; &#1085;&#1080; &#1088;&#1072;&#1079;&#1091; &#1085;&#1077; &#1080;&#1075;&#1088;&#1072;&#1103; &#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1099;&#1077; &#1080;&#1075;&#1088;&#1091;&#1096;&#1082;&#1080;.&#10;&#1071; &#1086;&#1073;&#1077;&#1097;&#1072;&#1102; &#1087;&#1088;&#1086;&#1078;&#1080;&#1090;&#1100; 2019 &#1075;&#1086;&#1076; &#1073;&#1077;&#1079; &#1087;&#1086;&#1088;&#1085;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1080;.&#10;&#1054;&#1073;&#1077;&#1097;&#1072;&#1102; &#1087;&#1088;&#1086;&#1078;&#1080;&#1090;&#1100; 2019 &#1075;&#1086;&#1076; &#1073;&#1077;&#1079; &#1093;&#1074;&#1086;&#1089;&#1090;&#1086;&#1074; &#1087;&#1086; &#1091;&#1095;&#1105;&#1073;&#1077;.&#10;&#1054;&#1073;&#1077;&#1097;&#1072;&#1102; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077;...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/2018-thanks-to-God/">За что я благодарю Бога по прошествии 2018-го года</a></h2><small class="header-metadata"><time datetime="2018-12-31T00:00:00.000Z" class="timestamp">31 Dec 2018</time></small></header><section class="content-article">&#1047;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086;, &#1087;&#1086; &#1074;&#1077;&#1083;&#1080;&#1082;&#1086;&#1081; &#1084;&#1080;&#1083;&#1086;&#1089;&#1090;&#1080; &#1057;&#1074;&#1086;&#1077;&#1081;, &#1041;&#1086;&#1075; &#1074;&#1077;&#1088;&#1085;&#1091;&#1083; &#1084;&#1077;&#1085;&#1103; &#1082; &#1057;&#1077;&#1073;&#1077; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1084;&#1086;&#1077;&#1075;&#1086; 4-&#1093; &#1084;&#1077;&#1089;&#1103;&#1095;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090; &#1053;&#1077;&#1075;&#1086; (&#1089; &#1056;&#1086;&#1078;&#1076;&#1077;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086; &#1055;&#1072;&#1089;&#1093;&#1091;). &#1052;&#1085;&#1077; &#1087;&#1088;&#1080;&#1089;&#1085;&#1080;&#1083;&#1089;&#1103; &#1089;&#1086;&#1085;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1073;&#1086;&#1084;&#1078;&#1077;&#1074;&#1072;&#1090;&#1099;&#1081; &#1072;&#1083;&#1082;&#1086;&#1075;&#1086;&#1083;&#1080;&#1082; &#1082;&#1091;&#1076;&#1072;-&#1090;&#1086; &#1076;&#1077;&#1083; &#1084;&#1086;&#1081; &#1074;&#1077;&#1083;&#1086;&#1089;&#1080;&#1087;&#1077;&#1076;, &#1080; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090; &#1084;&#1085;&#1077;: &#171;&#1053;&#1091;, &#1085;&#1080;&#1095;&#1077;&#1075;&#1086;...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/internal-state/">Внутреннее состояние Божьего человека</a></h2><small class="header-metadata"><time datetime="2018-12-29T00:00:00.000Z" class="timestamp">29 Dec 2018</time></small></header><section class="content-article">&#1057;&#1084;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; (&#1087;&#1086;&#1076;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#171;&#1103;&#187;). (&#1048;&#1089;. 66:2)&#10;&#1057;&#1086;&#1082;&#1088;&#1091;&#1096;&#1105;&#1085;&#1085;&#1099;&#1081; &#1076;&#1091;&#1093;. (&#1048;&#1089;. 66:2)&#10;&#1058;&#1088;&#1077;&#1087;&#1077;&#1097;&#1091;&#1097;&#1080;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076; &#1057;&#1083;&#1086;&#1074;&#1086;&#1084; &#1041;&#1086;&#1078;&#1080;&#1080;&#1084;. (&#1048;&#1089;. 66:2)&#10;&#1057;&#1077;&#1090;&#1091;&#1102;&#1097;&#1080;&#1081; (&#1085;&#1091;&#1078;&#1076;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1074; &#1091;&#1090;&#1077;&#1096;&#1077;&#1085;&#1080;&#1080;). (&#1048;&#1089;. 61:2)&#10;&#1059;&#1085;&#1099;&#1083;&#1099;&#1081; &#1076;&#1091;&#1093; (&#1087;&#1083;&#1072;&#1095;&#1091;&#1097;&#1080;&#1081;). (&#1048;&#1089;. 61:3)&#10;&#1054;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1076;&#1091;&#1096;&#1077;&#1074;&#1085;&#1086;&#1075;&#1086; &#1084;&#1080;&#1088;&#1072;. (&#1055;&#1083;&#1072;&#1095;. 3:17)&#10;&#1055;&#1086;&#1075;&#1080;&#1073;&#1096;&#1072;&#1103;...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/mac-keyboard-input/">Печать в русской раскладке и ввод специальных символов на Mac</a></h2><small class="header-metadata"><time datetime="2017-09-22T00:00:00.000Z" class="timestamp">22 Sep 2017</time></small></header><section class="content-article">&#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1103; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1083;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1074; &#1085;&#1072; Mac, &#8212; &#1101;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1085;&#1077;&#1087;&#1088;&#1080;&#1074;&#1099;&#1095;&#1085;&#1086;&#1077;, &#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1085;&#1077;&#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1077;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1080; &#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081; &#1074; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081; &#1088;&#1091;&#1089;&#1089;&#1082;&#1086;&#1081; &#1088;&#1072;&#1089;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1089;&#1105; &#1089;&#1090;&#1072;&#1083;&#1086; &#1085;&#1072; &#1089;&#1074;&#1086;&#1080; &#1084;&#1077;&#1089;&#1090;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1088;&#1091;&#1089;&#1089;&#1082;&#1091;&#1102; &#1088;&#1072;&#1089;&#1089;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091;...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/lost-and-found/">Что делать с найденным кошельком?</a></h2><small class="header-metadata"><time datetime="2017-03-05T00:00:00.000Z" class="timestamp">5 Mar 2017</time></small></header><section class="content-article">&#1041;&#1086;&#1075; &#1076;&#1072;&#1083; &#1095;&#1105;&#1090;&#1082;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1087;&#1086; &#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1086;&#1074;&#1086;&#1076;&#1091;:&#10;&#10;&#1050;&#1086;&#1075;&#1076;&#1072; &#1091;&#1074;&#1080;&#1076;&#1080;&#1096;&#1100; &#1074;&#1086;&#1083;&#1072; &#1073;&#1088;&#1072;&#1090;&#1072; &#1090;&#1074;&#1086;&#1077;&#1075;&#1086; &#1080;&#1083;&#1080; &#1086;&#1074;&#1094;&#1091; &#1077;&#1075;&#1086; &#1079;&#1072;&#1073;&#1083;&#1091;&#1076;&#1080;&#1074;&#1096;&#1080;&#1093;&#1089;&#1103;, &#1085;&#1077; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1081; &#1080;&#1093;, &#1085;&#1086; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1080; &#1080;&#1093; &#1073;&#1088;&#1072;&#1090;&#1091; &#1090;&#1074;&#1086;&#1077;&#1084;&#1091;;&#10;&#1077;&#1089;&#1083;&#1080; &#1078;&#1077; &#1085;&#1077; &#1073;&#1083;&#1080;&#1079;&#1082;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1082; &#1090;&#1077;&#1073;&#1077; &#1073;&#1088;&#1072;&#1090; &#1090;&#1074;&#1086;&#1081;, &#1080;&#1083;&#1080; &#1090;&#1099; &#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1096;&#1100; &#1077;&#1075;&#1086;, &#1090;&#1086; &#1087;&#1088;&#1080;&#1073;&#1077;&#1088;&#1080; &#1080;&#1093; &#1074; &#1076;&#1086;&#1084; &#1089;&#1074;&#1086;&#1081;, &#1080; &#1087;&#1091;&#1089;&#1090;&#1100; &#1086;&#1085;&#1080;...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/wakeup/">Пробудитесь!</a></h2><small class="header-metadata"><time datetime="2016-02-19T00:00:00.000Z" class="timestamp">19 Feb 2016</time></small></header><section class="content-article">&#1062;&#1077;&#1088;&#1082;&#1086;&#1074;&#1100; &#1041;&#1086;&#1078;&#1080;&#1103;, &#1084;&#1099; &#1082;&#1091;&#1087;&#1083;&#1077;&#1085;&#1099; &#1076;&#1086;&#1088;&#1086;&#1075;&#1086;&#1081; &#1094;&#1077;&#1085;&#1086;&#1081; &#1080; &#1085;&#1077; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1080;&#1084; &#1091;&#1078;&#1077; &#1089;&#1077;&#1073;&#1077; &#10;(1&#1050;&#1086;&#1088;.6:19,20). &#1041;&#1086;&#1075; &#1085;&#1072;&#1084; &#1085;&#1077; &#1087;&#1072;&#1088;&#1090;&#1085;&#1105;&#1088;, &#1085;&#1077; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1100;&#1086;&#1085;, &#1072; &#1087;&#1086;&#1083;&#1085;&#1086;&#1087;&#1088;&#1072;&#1074;&#1085;&#1099;&#1081; &#1074;&#1083;&#1072;&#1076;&#1077;&#1083;&#1077;&#1094; &#1080; &#10;&#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;. &#1041;&#1086;&#1075;&#1086;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#171;&#1054;&#1085; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1082;&#1088;&#1086;&#1084;&#1077; &#1075;&#1088;&#1077;&#1093;&#1072;&#187; &#10;&#1085;&#1077;&#1073;&#1080;&#1073;&#1083;&#1077;&#1081;&#1089;&#1082;&#1086;&#1077;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1041;&#1086;&#1075;&#1091; &#1085;&#1077;...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/empireofcode-python-solutions/">Empire of Code Python solutions</a></h2><small class="header-metadata"><time datetime="2016-02-05T00:00:00.000Z" class="timestamp">5 Feb 2016</time></small></header><section class="content-article">Here is a gist with my Empire of Code solutions in Python programming language:</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/empireofcode-javascript-solutions/">Empire of Code JavaScript solutions</a></h2><small class="header-metadata"><time datetime="2016-02-05T00:00:00.000Z" class="timestamp">5 Feb 2016</time></small></header><section class="content-article">Here is a gist with my Empire of Code solutions in JavaScript programming language:</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/new-year-true-way/">Как правильно начать новый год</a></h2><small class="header-metadata"><time datetime="2016-01-22T00:00:00.000Z" class="timestamp">22 Jan 2016</time></small></header><section class="content-article">&#1040;&#1088;&#1090;&#1091;&#1088; &#1085;&#1072;  &#1084;&#1086;&#1083;&#1086;&#1076;&#1105;&#1078;&#1085;&#1086;&#1084; &#1089;&#1086;&#1073;&#1088;&#1072;&#1085;&#1080;&#1080; &#1074;&#1099;&#1076;&#1072;&#1083; &#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093; &#1089;&#1086;&#1074;&#1077;&#1090;&#1086;&#1074; &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1075;&#1086;&#1076; &#1089; &#1082;&#1091;&#1095;&#1077;&#1081; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074;, &#1086;&#1085; &#1076;&#1072;&#1078;&#1077; &#1074;&#1099;&#1083;&#1086;&#1078;&#1080;&#1083; &#1089;&#1083;&#1072;&#1081;&#1076;&#1099; &#1087;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1103; &#1088;&#1077;&#1096;&#1080;&#1083; &#1095;&#1090;&#1086; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083; &#1076;&#1086;&#1089;&#1090;&#1086;&#1080;&#1085; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1077;&#1073;&#1077; &#1077;&#1075;&#1086; &#1082;&#1088;&#1072;&#1090;&#1082;&#1080;&#1081; &#1082;&#1086;&#1085;&#1089;&#1087;&#1077;&#1082;&#1090;.&#10;&#1050;&#1072;&#1082; &#1042;&#1086;&#1087;&#1083;&#1086;&#1090;&#1080;&#1090;&#1100;...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/remarriage/">Библейский взгляд на повторный брак</a></h2><small class="header-metadata"><time datetime="2015-11-25T00:00:00.000Z" class="timestamp">25 Nov 2015</time></small></header><section class="content-article">&#1055;&#1086; &#1084;&#1077;&#1088;&#1077; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1053;&#1086;&#1074;&#1086;&#1075;&#1086; &#1047;&#1072;&#1074;&#1077;&#1090;&#1072;, &#1091; &#1084;&#1077;&#1085;&#1103; &#1087;&#1086;&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1085;&#1086; &#1089;&#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1041;&#1086;&#1075; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1099;&#1084; &#1073;&#1088;&#1072;&#1082;&#1072;&#1084; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1041;&#1080;&#1073;&#1083;&#1080;&#1080;. &#1044;&#1083;&#1103; &#1041;&#1086;&#1075;&#1072; &#1073;&#1088;&#1072;&#1082; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1080;&#1083;&#1091; &#1076;&#1086; &#1089;&#1084;&#1077;&#1088;&#1090;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1091;&#1087;&#1088;&#1091;&#1075;&#1086;&#1074;, &#1072; &#1085;&#1077; &#1076;&#1086; &#1088;&#1072;&#1079;&#1074;&#1086;&#1076;&#1072;, &#1080; &#1093;&#1086;&#1090;&#1103; &#1088;&#1072;&#1079;&#1074;&#1086;&#1076; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072;...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/Installing-Lazarus-Mac-OS-X/">Installing Lazarus on Mac OS X.</a></h2><small class="header-metadata"><time datetime="2015-06-11T00:00:00.000Z" class="timestamp">11 Jun 2015</time></small></header><section class="content-article">Lazaruz is open sourced cross-platform IDE for Pascal programming language.&#10;Before you begin Lazaruz installation, you must have gdb installed. Mac OS X users can install it by using brew utility. Just type this command in terminal application:&#10;After...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/from-Octopress-to-Metalsmith/">Moved this blog from Octopress to Metalsmith.</a></h2><small class="header-metadata"><time datetime="2015-04-08T00:00:00.000Z" class="timestamp">8 Apr 2015</time></small></header><section class="content-article">Moved this blog from Octopress to Metalsmith. CSS was borrowed from @mdo&#39;s  Hyde theme for Jekyll.</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/hello-spring/">Hello Spring!</a></h2><small class="header-metadata"><time datetime="2015-03-01T00:00:00.000Z" class="timestamp">1 Mar 2015</time></small></header><section class="content-article">&#1042;&#1077;&#1089;&#1085;&#1072; &#1086;&#1095;&#1077;&#1085;&#1100; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090; &#1076;&#1083;&#1103; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1041;&#1086;&#1075; &#1082;&#1072;&#1089;&#1072;&#1077;&#1090;&#1089;&#1103; &#1077;&#1075;&#1086; &#1089;&#1077;&#1088;&#1076;&#1094;&#1072;: &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1041;&#1086;&#1075; &#1088;&#1072;&#1089;&#1090;&#1072;&#1087;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1083;&#1077;&#1076; &#1080; &#1086;&#1073;&#1085;&#1072;&#1078;&#1072;&#1077;&#1090; &#1074;&#1089;&#1102; &#1085;&#1072;&#1096;&#1091; &#1075;&#1088;&#1103;&#1079;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1099; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1083;&#1080; &#1076;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1057;&#1074;&#1086;&#1077;&#1081; &#1078;&#1080;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1080;&#1083;&#1086;&#1081;...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/rake-aborted-with-swp-during-octopress-deploy/">Exclude .swp files during Octopress deploy</a></h2><small class="header-metadata"><time datetime="2014-07-11T00:00:00.000Z" class="timestamp">11 Jul 2014</time></small></header><section class="content-article">&#1071; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1089;&#1100; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1086;&#1084; Vim &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1074; &#1089;&#1074;&#1086;&#1105;&#1084; &#1073;&#1083;&#1086;&#1075;&#1077; powered by Octopress.&#10;&#1059; &#1084;&#1077;&#1085;&#1103; &#1074;&#1099;&#1083;&#1077;&#1079;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1072;&#1103; &#1089; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; copydot &#1085;&#1077; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090; .swp &#1092;&#1072;&#1081;&#1083;&#1099; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1087;&#1080;&#1081; &#1076;&#1083;&#1103; vim:&#10;&#10;cp -r source/_posts/.2014-05-06-page.md.swp...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/codecombat-solutions/">CodeCombat solutions</a></h2><small class="header-metadata"><time datetime="2014-06-19T00:00:00.000Z" class="timestamp">19 Jun 2014</time></small></header><section class="content-article">Here are some gists with my solutions in CoffeeScript and in JavaScript programming languages:&#10;&#10;Kithgard Dungeon Campaign&#10;Backwoods Forest Campaign&#10;Sarven Desert Campaign&#10;Cloudrip Mountain Campaign&#10;Kelvintaph Glacier Campaign&#10;Hour of Code JavaScript...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/page-build-failed-during-octopress-deploy/">Page build failed during Octopress deploy</a></h2><small class="header-metadata"><time datetime="2014-05-06T00:00:00.000Z" class="timestamp">6 May 2014</time></small></header><section class="content-article">&#1042; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1091; &#1084;&#1077;&#1085;&#1103; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084; &#1084;&#1086;&#1077;&#1075;&#1086; powered by Octopress &#1073;&#1083;&#1086;&#1075;&#1072; &#1085;&#1072; Github Pages:&#10;&#10;The page build failed with the following error:&#10;Page build failed.&#10;&#10;&#1041;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1102; &#1072;&#1074;&#1090;&#1086;&#1088;&#1072; &#1089;&#1090;&#1072;&#1090;&#1100;&#1080; Adventures in Ruby, &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1088;&#1077;&#1096;&#1080;&#1083;&#1072;&#1089;&#1100;...</section></article><article class="post"><header class="header"><h2 class="content-title"><a href="/posts/latex-cv-ru/">Резюме в LaTeX</a></h2><small class="header-metadata"><time datetime="2011-03-27T00:00:00.000Z" class="timestamp">27 Mar 2011</time></small></header><section class="content-article">&#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1080; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1077;&#1085;&#1080;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089; moderncv, &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100; &#1087;&#1072;&#1082;&#1077;&#1090; moderncv.zip, &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1072; .tex &#1092;&#1072;&#1081;&#1083; &#1089; &#1074;&#1072;&#1096;&#1080;&#1084; &#1088;&#1077;&#1079;&#1102;&#1084;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1090;&#1086;&#1081; &#1078;&#1077; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1095;&#1090;&#1086; &#1080; &#1092;&#1072;&#1081;&#1083; moderncv.cls   &#1080; &#1092;&#1072;&#1081;&#1083;&#1099; .sty .&#10; &#1059; &#1084;&#1077;&#1085;&#1103; &#1074; Ubuntu &#1091;&#1078;&#1077; &#1073;&#1099;&#1083; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;...</section></article></div><nav class="navigation cf pagination"></nav></div><script src="/js/bible.min.js" type="text/javascript" charset="utf-8" defer="defer"></script>
<script>(function(w){function init(){
	bibleRef.conf("Translate", "rus");
	bibleRef.conf("Target", "_blank");
	bibleRef.conf("ToolTipUse", true);
	bibleRef.conf("NoTags", []);
	bibleRef.conf("VSeparator", ":.");
	bibleRef.conf("RSeparator", ",");
	bibleRef.conf("CSeparator", ";");
}if(w.addEventListener){w.addEventListener("load",function(){init()},false);}else{w.attachEvent("onload",function(){init()});}})(window);</script>
</body></html>